---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionTextPosition
source: html/089d944f-fe7c-8edb-2532-10cdd142f9b4.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionTextPosition Property

Identifies the text position with respect to dimension line.

## Syntax (C#)
```csharp
public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration